## Контрольная работа. Задача
___

***Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.***


Примеры:
```C#
[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
[“1234”, “1567”, “-2”, “computer science”] → [“-2”]
[“Russia”, “Denmark”, “Kazan”] → []
```
Код программы:

```C#
Console.WriteLine("Введите длину массива");
int len_arr_init = int.Parse(Console.ReadLine()!); // Вводим длину массива с клавиатуры
string[] arr_init = new string[len_arr_init]; // Создаем массив указанной длины
int len_of_element_to_check = 3; // Задаем эталонную длину элементов
string elements = ""; // Строка для конкатенации элементов длиной <= 3 символов
for (int i = 0; i < len_arr_init; i++){
    Console.Write($"Введите строку для {i}-го элемента массива: ");
    arr_init[i] = Console.ReadLine()!;
    if (arr_init[i].Length <= len_of_element_to_check){
        elements += (arr_init[i]+" ");
    }
}

string[] arr_final = elements.Split(new string[]{" "}, StringSplitOptions.RemoveEmptyEntries);
Console.WriteLine($"[{String.Join(", ", arr_init)}] ->  [{String.Join(", ", arr_final)}]");
```
1. При выполнении программы пользователю потребуется ввести длину массива строк **len_arr_init**, которые затем пользователь введет при заполнении массива.
2. В цикле **for** пользователь заполняет массив **arr_init** элементами
    - в блоке кода **if** идет сравнение длины только что введенной строки **arr_init[i]** с эталонной длинной **len_of_element_to_check** (3 символа). Если длина элемента меньше или равна эталонной, то элемент конкатенируется в строку **elements** с такими же элементами.
3. формируем массив элементов **arr_final** длиной меньше или равной 3 символов
4. Печать элементов из **arr_final**

